sim-testnet/peerreview/evidence/FINAL-2-preparation-fixes-20260916/interim/pf02/inputs/causal/unbound_operator_specs/mutation.patch
diff --git a/sim-testnet/process.go b/sim-testnet/process.go
index 2aeb54b..0cdbb6b 100644
--- a/sim-testnet/process.go
+++ b/sim-testnet/process.go
@@ -1506,9 +1506,6 @@ func buildServerSpecs(cfg *ResolvedConfig, stateDir string, bins map[string]stri
 			if svc.role == "connect" {
 				args = append(args, "--tls-default-host="+listenIP, "--direct-h3-loopback")
 			}
-			if svc.role == "taskworker" {
-				args = append(args, "--workload-profile=subnet-operator")
-			}
 			spec := ProcessSpec{ID: id, Role: "operator-" + svc.role, Identity: fmt.Sprintf("no:%d", i), Command: bins[svc.bin], Args: args, WorkDir: cfg.Repos.Server, Env: env, StdoutPath: filepath.Join(stateDir, "processes", id+".stdout.log"), StderrPath: filepath.Join(stateDir, "processes", id+".stderr.log"), HealthURL: fmt.Sprintf("http://%s:%d/status", listenIP, svc.port), RestartLimit: 5}
 			if svc.role == "connect" {
 				spec.H3ProbeAddress = net.JoinHostPort(listenIP, "443")
